var heatmapData = [
    {
        "id": "0",
        "lng": "114.33465",
        "lat": "30.578837",
        "name": "湖北大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "1",
        "lng": "114.329738",
        "lat": "30.556129",
        "name": "湖北省图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "2",
        "lng": "114.309739",
        "lat": "30.552163",
        "name": "云曰书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "3",
        "lng": "114.356753",
        "lat": "30.554571",
        "name": "武汉大学图书馆医学分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "4",
        "lng": "114.357673",
        "lat": "30.604761",
        "name": "武汉理工大学余家头校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "5",
        "lng": "114.362712",
        "lat": "30.535956",
        "name": "武汉大学文理图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "6",
        "lng": "114.306663",
        "lat": "30.546108",
        "name": "武汉市武昌区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "7",
        "lng": "114.304257",
        "lat": "30.540220",
        "name": "24小时自助图书馆(体育街)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "8",
        "lng": "114.361465",
        "lat": "30.543853",
        "name": "武汉大学图书馆工学分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "9",
        "lng": "114.373129",
        "lat": "30.578505",
        "name": "武汉纺织大学东湖校区图书馆(求知路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "10",
        "lng": "114.330906",
        "lat": "30.555658",
        "name": "湖北省图书馆24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "11",
        "lng": "114.344127",
        "lat": "30.546845",
        "name": "24小时自助图书馆(鹰台路步行街)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "12",
        "lng": "114.342068",
        "lat": "30.554355",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "13",
        "lng": "114.348200",
        "lat": "30.585250",
        "name": "武汉铁路局党校-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "14",
        "lng": "114.363697",
        "lat": "30.540086",
        "name": "武汉大学早期建筑图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "15",
        "lng": "114.347934",
        "lat": "30.538523",
        "name": "湖北省科学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "16",
        "lng": "114.316304",
        "lat": "30.532624",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "17",
        "lng": "114.371654",
        "lat": "30.537071",
        "name": "武汉大学枫园阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "18",
        "lng": "114.313046",
        "lat": "30.536828",
        "name": "中南财经政法大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "19",
        "lng": "114.314003",
        "lat": "30.538707",
        "name": "中南财经政法大学首义校区MBA学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "20",
        "lng": "114.293162",
        "lat": "30.535658",
        "name": "武汉大学医学职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "21",
        "lng": "114.339391",
        "lat": "30.544192",
        "name": "湖北省科技文献中心阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "22",
        "lng": "114.327176",
        "lat": "30.577784",
        "name": "武汉航海职业技术学院图书馆(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "23",
        "lng": "114.347934",
        "lat": "30.538526",
        "name": "中国科学院武汉图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "24",
        "lng": "114.298985",
        "lat": "30.515716",
        "name": "湖北财税职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "25",
        "lng": "114.306307",
        "lat": "30.546027",
        "name": "军干所省图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "26",
        "lng": "114.339376",
        "lat": "30.544180",
        "name": "湖北科教大厦-阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "27",
        "lng": "114.371865",
        "lat": "30.578276",
        "name": "武汉光谷职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "28",
        "lng": "114.362895",
        "lat": "30.535781",
        "name": "武汉大学珞珈文库",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "29",
        "lng": "114.315048",
        "lat": "30.510424",
        "name": "武汉市少儿图书馆南湖街分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "30",
        "lng": "114.281809",
        "lat": "30.603064",
        "name": "武汉图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "31",
        "lng": "114.270774",
        "lat": "30.60313",
        "name": "江汉区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "32",
        "lng": "114.2827",
        "lat": "30.603292",
        "name": "24小时自助图书馆(建设大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "33",
        "lng": "114.260167",
        "lat": "30.586181",
        "name": "万松街航空社区图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "34",
        "lng": "114.292104",
        "lat": "30.567028",
        "name": "24小时自助图书馆(沿江大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "35",
        "lng": "114.262545",
        "lat": "30.584680",
        "name": "万松街社区图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "36",
        "lng": "114.257280",
        "lat": "30.611976",
        "name": "Wuhan Library24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "37",
        "lng": "114.245950",
        "lat": "30.628489",
        "name": "全英图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "38",
        "lng": "114.268674",
        "lat": "30.601284",
        "name": "江汉区图书馆金桥书院",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "39",
        "lng": "114.249247",
        "lat": "30.613617",
        "name": "银河里社区电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "40",
        "lng": "114.294441",
        "lat": "30.582595",
        "name": "武汉市少年儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "41",
        "lng": "114.291664",
        "lat": "30.583483",
        "name": "江岸区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "42",
        "lng": "114.310387",
        "lat": "30.610705",
        "name": "悠贝绘本馆图书馆(武汉天地壹方购物中心店)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "43",
        "lng": "114.286523",
        "lat": "30.588194",
        "name": "24小时自助图书馆(解放大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "44",
        "lng": "114.303383",
        "lat": "30.604252",
        "name": "武汉市少儿图书馆(四唯路分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "45",
        "lng": "114.277952",
        "lat": "30.627575",
        "name": "汉口图书大世界",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "46",
        "lng": "114.291085",
        "lat": "30.613256",
        "name": "小钰米少儿英文图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "47",
        "lng": "114.291554",
        "lat": "30.583407",
        "name": "江岸区少儿图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "48",
        "lng": "114.308224",
        "lat": "30.594845",
        "name": "武汉图书馆24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "49",
        "lng": "114.291663",
        "lat": "30.583469",
        "name": "江岸区少年儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "50",
        "lng": "114.293760",
        "lat": "30.617736",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "51",
        "lng": "114.287474",
        "lat": "30.615049",
        "name": "声音传奇图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "52",
        "lng": "114.300965",
        "lat": "30.617247",
        "name": "加州幼儿园-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "53",
        "lng": "114.319101",
        "lat": "30.626239",
        "name": "江岸铁路文化宫图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "54",
        "lng": "114.300316",
        "lat": "30.598348",
        "name": "浪丘英语图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "55",
        "lng": "114.269449",
        "lat": "30.632814",
        "name": "24小时自助图书馆(后湖大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "56",
        "lng": "114.300936",
        "lat": "30.607654",
        "name": "解放公园-24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "57",
        "lng": "114.299834",
        "lat": "30.579170",
        "name": "自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "58",
        "lng": "114.287061",
        "lat": "30.624680",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "59",
        "lng": "114.372788",
        "lat": "30.689201",
        "name": "湖北大学知行学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "60",
        "lng": "114.257519",
        "lat": "30.569703",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "61",
        "lng": "114.260412",
        "lat": "30.581152",
        "name": "华中科技大学同济医学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "62",
        "lng": "114.210355",
        "lat": "30.597712",
        "name": "硚口区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "63",
        "lng": "114.226682",
        "lat": "30.580722",
        "name": "武汉图书馆24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "64",
        "lng": "114.214091",
        "lat": "30.588353",
        "name": "武汉图书馆军休三中心共建图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "65",
        "lng": "114.212216",
        "lat": "30.598284",
        "name": "24小时自助图书馆(南泥湾大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "66",
        "lng": "114.226634",
        "lat": "30.599617",
        "name": "发展社区-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "67",
        "lng": "114.264952",
        "lat": "30.570691",
        "name": "硚口区城市管理(执法)局离退休干部党支部阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "68",
        "lng": "114.254779",
        "lat": "30.572884",
        "name": "悠贝亲子图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "69",
        "lng": "114.200532",
        "lat": "30.594980",
        "name": "24小时自助图书馆(解放大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "70",
        "lng": "114.226563",
        "lat": "30.580858",
        "name": "武汉市第十七中学24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "71",
        "lng": "114.259196",
        "lat": "30.547268",
        "name": "翠微新城社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "72",
        "lng": "114.278221",
        "lat": "30.549469",
        "name": "24小时自助图书馆(拦江路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "73",
        "lng": "114.221383",
        "lat": "30.554363",
        "name": "武汉市汉阳区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "74",
        "lng": "114.260437",
        "lat": "30.54664",
        "name": "武汉归元正藏图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "75",
        "lng": "114.234834",
        "lat": "30.566869",
        "name": "武汉船舶职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "76",
        "lng": "114.267287",
        "lat": "30.548277",
        "name": "建桥街西大街社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "77",
        "lng": "114.205167",
        "lat": "30.552129",
        "name": "人信汇海豚儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "78",
        "lng": "114.204512",
        "lat": "30.501800",
        "name": "悠贝亲子图书馆(经开永旺纳芙朗馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "79",
        "lng": "114.206903",
        "lat": "30.505149",
        "name": "悠贝亲子图书馆(经开永旺美吉姆馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "80",
        "lng": "114.267990",
        "lat": "30.559660",
        "name": "江汉桥社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "81",
        "lng": "114.277007",
        "lat": "30.549492",
        "name": "莲花湖社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "82",
        "lng": "114.218724",
        "lat": "30.559278",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "83",
        "lng": "114.209566",
        "lat": "30.565625",
        "name": "玫瑰西园社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "84",
        "lng": "109.909303",
        "lat": "40.647433",
        "name": "绘本TAXI儿童连锁图书馆(保利店)",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "85",
        "lng": "109.907442",
        "lat": "40.650563",
        "name": "童友图书",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "86",
        "lng": "109.885701",
        "lat": "40.653643",
        "name": "包头师范学院-图书馆",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "87",
        "lng": "109.891249",
        "lat": "40.659564",
        "name": "涵思亲子阅读馆",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "88",
        "lng": "109.872294",
        "lat": "40.668075",
        "name": "青山区图书馆",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "89",
        "lng": "109.948497",
        "lat": "40.636427",
        "name": "包头轻工职业技术学院图书馆",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "90",
        "lng": "109.890080",
        "lat": "40.669171",
        "name": "包头职业技术学院-图书馆",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "91",
        "lng": "109.860085",
        "lat": "40.656765",
        "name": "舣舫公益图书馆(华联店)",
        "cityname": "包头市",
        "province": "内蒙古自治区",
        "count": "1"
    },
    {
        "id": "92",
        "lng": "114.361341",
        "lat": "30.528984",
        "name": "武汉大学信息学部图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "93",
        "lng": "114.360716",
        "lat": "30.520017",
        "name": "华中师范大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "94",
        "lng": "114.353908",
        "lat": "30.519158",
        "name": "武汉理工大学东区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "95",
        "lng": "114.389608",
        "lat": "30.605656",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "96",
        "lng": "114.328351",
        "lat": "30.50415",
        "name": "洪山区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "97",
        "lng": "114.317787",
        "lat": "30.516489",
        "name": "书画阅览",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "98",
        "lng": "114.399349",
        "lat": "30.518583",
        "name": "中国地质大学西区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "99",
        "lng": "114.308362",
        "lat": "30.509387",
        "name": "红旗·九里少儿图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "100",
        "lng": "114.368568",
        "lat": "30.584002",
        "name": "武汉地铁自助图书馆(铁机路地铁站点)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "101",
        "lng": "114.347790",
        "lat": "30.522600",
        "name": "武汉理工大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "102",
        "lng": "114.347696",
        "lat": "30.522655",
        "name": "武汉理工大学西区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "103",
        "lng": "114.401543",
        "lat": "30.492729",
        "name": "清觅自习室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "104",
        "lng": "114.391221",
        "lat": "30.502581",
        "name": "武汉工程大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "105",
        "lng": "114.361366",
        "lat": "30.529050",
        "name": "武汉大学图书馆信息科学分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "106",
        "lng": "114.333601",
        "lat": "30.509736",
        "name": "武汉理工大学南湖新校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "107",
        "lng": "114.35375",
        "lat": "30.519141",
        "name": "武汉理工大学马房山校区东院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "108",
        "lng": "114.425766",
        "lat": "30.586219",
        "name": "武汉城市学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "109",
        "lng": "114.286092",
        "lat": "30.481194",
        "name": "武昌工学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "110",
        "lng": "114.292513",
        "lat": "30.490587",
        "name": "湖北省图书馆(复地悦城分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "111",
        "lng": "114.327644",
        "lat": "30.503395",
        "name": "悠贝亲子图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "112",
        "lng": "114.357395",
        "lat": "30.471634",
        "name": "华中农业大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "113",
        "lng": "114.30726",
        "lat": "30.480019",
        "name": "湖北工业大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "114",
        "lng": "114.343919",
        "lat": "30.51296",
        "name": "武汉理工大学图书馆信息分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "115",
        "lng": "114.412059",
        "lat": "30.512715",
        "name": "华中科技大学图书馆(新馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "116",
        "lng": "114.391669",
        "lat": "30.487097",
        "name": "中南民族大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "117",
        "lng": "114.397415",
        "lat": "30.494097",
        "name": "24小时自助图书馆(民族大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "118",
        "lng": "114.273476",
        "lat": "30.45886",
        "name": "武汉工商学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "119",
        "lng": "114.336416",
        "lat": "30.498332",
        "name": "24小时自助图书馆(书城路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "120",
        "lng": "114.432433",
        "lat": "30.510472",
        "name": "华中科技大学东校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "121",
        "lng": "114.345907",
        "lat": "30.461129",
        "name": "湖北生物科技职业学院南湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "122",
        "lng": "114.411889",
        "lat": "30.512010",
        "name": "华中科技大学图书馆(老馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "123",
        "lng": "114.366238",
        "lat": "30.524329",
        "name": "武汉电力职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "124",
        "lng": "114.406142",
        "lat": "30.474185",
        "name": "24小时自助图书馆(软件园东路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "125",
        "lng": "114.359738",
        "lat": "30.593289",
        "name": "书小鱼·共享图书馆(保利馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "126",
        "lng": "114.392317",
        "lat": "30.487934",
        "name": "中南民族大学北书院",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "127",
        "lng": "114.399082",
        "lat": "30.485908",
        "name": "武汉纺织大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "128",
        "lng": "114.413354",
        "lat": "30.484544",
        "name": "武汉职业技术学院东区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "129",
        "lng": "114.270667",
        "lat": "30.448068",
        "name": "湖北中医药大学黄家湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "130",
        "lng": "114.327542",
        "lat": "30.504204",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "131",
        "lng": "114.377858",
        "lat": "30.500553",
        "name": "湖北商贸学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "132",
        "lng": "114.370623",
        "lat": "30.511923",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "133",
        "lng": "114.372601",
        "lat": "30.508816",
        "name": "湖北交通职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "134",
        "lng": "114.308341",
        "lat": "30.488456",
        "name": "武昌首义学院图书馆中区分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "135",
        "lng": "114.308698",
        "lat": "30.485952",
        "name": "武昌首义学院图书馆南区分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "136",
        "lng": "114.266933",
        "lat": "30.437754",
        "name": "武汉科技大学图书馆(黄家湖西路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "137",
        "lng": "114.322257",
        "lat": "30.476375",
        "name": "武汉城市职业学院北校区-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "138",
        "lng": "114.265617",
        "lat": "30.428837",
        "name": "武汉交通职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "139",
        "lng": "114.344007",
        "lat": "30.512915",
        "name": "武汉理工大学鉴湖校区图书馆信息分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "140",
        "lng": "114.345511",
        "lat": "30.521651",
        "name": "湖北轻工职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "141",
        "lng": "114.356519",
        "lat": "30.525407",
        "name": "东境声音图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "142",
        "lng": "114.415185",
        "lat": "30.541500",
        "name": "德善公益图书馆大李村书屋",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "143",
        "lng": "114.476467",
        "lat": "30.481592",
        "name": "24小时自助图书馆(二妃山庄前厅部西南)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "144",
        "lng": "114.391924",
        "lat": "30.529708",
        "name": "中国数字图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "145",
        "lng": "114.308835",
        "lat": "30.486291",
        "name": "武昌首义学院南区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "146",
        "lng": "114.618256",
        "lat": "30.456304",
        "name": "中国地质大学未来城校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "147",
        "lng": "114.398885",
        "lat": "30.486060",
        "name": "图书馆信息服务中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "148",
        "lng": "114.255704",
        "lat": "30.649501",
        "name": "将军路文化广场图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "149",
        "lng": "114.235393",
        "lat": "30.637623",
        "name": "武汉轻工大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "150",
        "lng": "114.193156",
        "lat": "30.628698",
        "name": "悠贝亲子图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "151",
        "lng": "114.222509",
        "lat": "30.652311",
        "name": "武汉轻工大学金银湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "152",
        "lng": "114.139381",
        "lat": "30.62539",
        "name": "武汉市东西湖区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "153",
        "lng": "114.171949",
        "lat": "30.661641",
        "name": "诺丁图书阅读室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "154",
        "lng": "114.150724",
        "lat": "30.628949",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "155",
        "lng": "114.139415",
        "lat": "30.625359",
        "name": "东西湖区总工会职工阅览中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "156",
        "lng": "114.139567",
        "lat": "30.625302",
        "name": "湖北作家文献中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "157",
        "lng": "114.244914",
        "lat": "30.647235",
        "name": "武汉市常青树实验学校图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "158",
        "lng": "114.132638",
        "lat": "30.624393",
        "name": "武汉图书馆24小时自助图书馆(六顺路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "159",
        "lng": "114.136971",
        "lat": "30.675372",
        "name": "网安学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "160",
        "lng": "114.128230",
        "lat": "30.625178",
        "name": "武汉警官职业学院(东西湖校区)-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "161",
        "lng": "114.085243",
        "lat": "30.31216",
        "name": "武汉市汉南区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "162",
        "lng": "114.086591",
        "lat": "30.315518",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "163",
        "lng": "114.092892",
        "lat": "30.352698",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "164",
        "lng": "114.084452",
        "lat": "30.306059",
        "name": "武汉经济技术开发区(汉南区)文化馆图书馆纱帽街分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "165",
        "lng": "114.076585",
        "lat": "30.313434",
        "name": "武汉市汉南区纱帽中学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "166",
        "lng": "113.821633",
        "lat": "30.219703",
        "name": "汉南农场螃蟹养殖协会阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "167",
        "lng": "114.158517",
        "lat": "30.514117",
        "name": "江汉大学-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "168",
        "lng": "114.162653",
        "lat": "30.468622",
        "name": "汤湖图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "169",
        "lng": "114.162542",
        "lat": "30.504865",
        "name": "悠贝亲子图书馆(经开文汐素质成长中心)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "170",
        "lng": "114.153244",
        "lat": "30.489539",
        "name": "24小时自助图书馆(联城路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "171",
        "lng": "114.153026",
        "lat": "30.489600",
        "name": "沌阳街文体事业服务中心图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "172",
        "lng": "114.159257",
        "lat": "30.512648",
        "name": "江汉大学法学院资料室阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "173",
        "lng": "114.035953",
        "lat": "30.576905",
        "name": "武汉市蔡甸区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "174",
        "lng": "114.191652",
        "lat": "30.460311",
        "name": "(汉南区)文化馆图书馆沌口街分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "175",
        "lng": "114.087571",
        "lat": "30.462508",
        "name": "武汉商学院北区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "176",
        "lng": "114.028936",
        "lat": "30.529199",
        "name": "长江大学武汉校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "177",
        "lng": "114.074870",
        "lat": "30.461658",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "178",
        "lng": "114.184854",
        "lat": "30.494234",
        "name": "图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "179",
        "lng": "114.035792",
        "lat": "30.576862",
        "name": "新华书店图书馆活动展览厅",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "180",
        "lng": "114.026828",
        "lat": "30.579306",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "181",
        "lng": "114.172892",
        "lat": "30.499789",
        "name": "海豚儿童阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "182",
        "lng": "114.191617",
        "lat": "30.460247",
        "name": "图书·电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "183",
        "lng": "114.035892",
        "lat": "30.576792",
        "name": "汉阳县图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "184",
        "lng": "113.816760",
        "lat": "30.449217",
        "name": "武汉市蔡甸区侏儒街中刘村图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "185",
        "lng": "114.385001",
        "lat": "30.473913",
        "name": "中南财经政法大学南湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "186",
        "lng": "114.294285",
        "lat": "30.440409",
        "name": "陈一丹伉俪图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "187",
        "lng": "114.440597",
        "lat": "30.49366",
        "name": "文华学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "188",
        "lng": "114.400081",
        "lat": "30.457421",
        "name": "书小鱼·共享图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "189",
        "lng": "114.317371",
        "lat": "30.423975",
        "name": "武汉东湖学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "190",
        "lng": "114.433128",
        "lat": "30.460711",
        "name": "武汉工程大学流芳校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "191",
        "lng": "114.379715",
        "lat": "30.474338",
        "name": "中南财经政法大学南湖校区图书馆(明德路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "192",
        "lng": "114.450092",
        "lat": "30.480851",
        "name": "湖北第二师范学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "193",
        "lng": "114.324087",
        "lat": "30.357122",
        "name": "江夏区青少年读书馆(新华书店分店)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "194",
        "lng": "114.43621",
        "lat": "30.417617",
        "name": "湖北经济学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "195",
        "lng": "114.410336",
        "lat": "30.468171",
        "name": "武汉华夏理工学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "196",
        "lng": "114.361316",
        "lat": "30.418056",
        "name": "武昌理工学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "197",
        "lng": "114.428752",
        "lat": "30.443539",
        "name": "武汉软件工程职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "198",
        "lng": "114.376407",
        "lat": "30.403695",
        "name": "武汉信息传播职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "199",
        "lng": "114.314775",
        "lat": "30.347088",
        "name": "江夏区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "200",
        "lng": "114.420501",
        "lat": "30.437014",
        "name": "武汉传媒学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "201",
        "lng": "114.338366",
        "lat": "30.377402",
        "name": "武汉纺织大学阳光校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "202",
        "lng": "114.417525",
        "lat": "30.392327",
        "name": "湖北美术学院藏龙岛校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "203",
        "lng": "114.314702",
        "lat": "30.351562",
        "name": "24小时自助图书馆(熊廷弼街)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "204",
        "lng": "114.406083",
        "lat": "30.371385",
        "name": "湖北水利水电职业技术学院-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "205",
        "lng": "114.316982",
        "lat": "30.415216",
        "name": "汉口学院-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "206",
        "lng": "114.461106",
        "lat": "30.436226",
        "name": "武汉商贸职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "207",
        "lng": "114.324100",
        "lat": "30.357032",
        "name": "江夏区图书馆青少年分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "208",
        "lng": "114.379489",
        "lat": "30.474500",
        "name": "中南财经政法大学南湖校区图书阅览中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "209",
        "lng": "114.388142",
        "lat": "30.474631",
        "name": "中南财经政法大学南湖校区法学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "210",
        "lng": "114.390561",
        "lat": "30.471591",
        "name": "红色中南党史阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "211",
        "lng": "114.330279",
        "lat": "30.354975",
        "name": "公益图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "212",
        "lng": "114.335981",
        "lat": "30.344181",
        "name": "湖北生态工程职业技术学院网络电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "213",
        "lng": "114.437738",
        "lat": "30.464612",
        "name": "武汉市仪表电子学校图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "214",
        "lng": "114.448756",
        "lat": "30.490095",
        "name": "湖北体育职业学院电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "215",
        "lng": "114.329365",
        "lat": "30.357633",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "216",
        "lng": "114.407906",
        "lat": "30.400612",
        "name": "武汉设计工程学院新图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "217",
        "lng": "114.409308",
        "lat": "30.401009",
        "name": "武汉设计工程学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "218",
        "lng": "114.433917",
        "lat": "30.398826",
        "name": "武汉体育学院体育科技学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "219",
        "lng": "114.417891",
        "lat": "30.385707",
        "name": "武汉纺织大学外经贸学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "220",
        "lng": "114.398968",
        "lat": "30.371143",
        "name": "武昌职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "221",
        "lng": "114.558122",
        "lat": "30.459552",
        "name": "豹澥图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "222",
        "lng": "114.303725",
        "lat": "30.694442",
        "name": "悠贝亲子图书馆·盘龙城万达馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "223",
        "lng": "114.419554",
        "lat": "30.701222",
        "name": "眼镜图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "224",
        "lng": "114.416190",
        "lat": "30.696431",
        "name": "中国梦图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "225",
        "lng": "114.424021",
        "lat": "30.703096",
        "name": "文体图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "226",
        "lng": "114.370334",
        "lat": "30.870181",
        "name": "黄陂图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "227",
        "lng": "114.292982",
        "lat": "30.797651",
        "name": "黄陂区图书馆(横店分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "228",
        "lng": "114.378257",
        "lat": "30.891096",
        "name": "图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "229",
        "lng": "114.299997",
        "lat": "30.917835",
        "name": "武汉图书馆·金寨村共建图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "230",
        "lng": "114.298118",
        "lat": "31.288782",
        "name": "图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "231",
        "lng": "114.341682",
        "lat": "31.018000",
        "name": "武汉市少年儿童图书馆(联合村分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "232",
        "lng": "114.527889",
        "lat": "30.713001",
        "name": "武汉生物工程学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "233",
        "lng": "114.708748",
        "lat": "30.774193",
        "name": "新洲职高图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "234",
        "lng": "114.801935",
        "lat": "30.843898",
        "name": "新洲区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "235",
        "lng": "114.600983",
        "lat": "30.833142",
        "name": "武汉市新洲区图书馆仓埠分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "236",
        "lng": "114.547797",
        "lat": "30.713918",
        "name": "武汉工程职业技术学院图书馆服务部",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "237",
        "lng": "114.796402",
        "lat": "30.845204",
        "name": "爱阅大眼睛儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    }
]