var heatmapData_hubei = [
    {
        "id": "0",
        "lng": "114.356753",
        "lat": "30.554571",
        "name": "武汉大学图书馆医学分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "1",
        "lng": "114.329738",
        "lat": "30.556129",
        "name": "湖北省图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "2",
        "lng": "114.362712",
        "lat": "30.535956",
        "name": "武汉大学文理图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "3",
        "lng": "114.361341",
        "lat": "30.528984",
        "name": "武汉大学信息学部图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "4",
        "lng": "114.344127",
        "lat": "30.546845",
        "name": "24小时自助图书馆(鹰台路步行街)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "5",
        "lng": "114.361465",
        "lat": "30.543853",
        "name": "武汉大学图书馆工学分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "6",
        "lng": "114.360716",
        "lat": "30.520017",
        "name": "华中师范大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "7",
        "lng": "114.353908",
        "lat": "30.519158",
        "name": "武汉理工大学东区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "8",
        "lng": "114.334603",
        "lat": "30.57873",
        "name": "湖北大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "9",
        "lng": "114.347934",
        "lat": "30.538523",
        "name": "湖北省科学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "10",
        "lng": "114.342068",
        "lat": "30.554355",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "11",
        "lng": "114.363697",
        "lat": "30.540086",
        "name": "武汉大学早期建筑图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "12",
        "lng": "114.330906",
        "lat": "30.555658",
        "name": "湖北省图书馆24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "13",
        "lng": "114.309739",
        "lat": "30.552163",
        "name": "云曰书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "14",
        "lng": "114.339391",
        "lat": "30.544192",
        "name": "湖北省科技文献中心阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "15",
        "lng": "114.347934",
        "lat": "30.538526",
        "name": "中国科学院武汉图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "16",
        "lng": "114.34779",
        "lat": "30.5226",
        "name": "武汉理工大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "17",
        "lng": "114.347696",
        "lat": "30.522655",
        "name": "武汉理工大学西区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "18",
        "lng": "114.399349",
        "lat": "30.518583",
        "name": "中国地质大学西区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "19",
        "lng": "114.306663",
        "lat": "30.546108",
        "name": "武汉市武昌区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "20",
        "lng": "114.317787",
        "lat": "30.516489",
        "name": "书画阅览",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "21",
        "lng": "114.304257",
        "lat": "30.54022",
        "name": "24小时自助图书馆(体育街)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "22",
        "lng": "114.328351",
        "lat": "30.50415",
        "name": "洪山区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "23",
        "lng": "114.35375",
        "lat": "30.519141",
        "name": "武汉理工大学马房山校区东院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "24",
        "lng": "114.371654",
        "lat": "30.537071",
        "name": "武汉大学枫园阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "25",
        "lng": "114.281809",
        "lat": "30.603064",
        "name": "武汉图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "26",
        "lng": "114.333601",
        "lat": "30.509736",
        "name": "武汉理工大学南湖新校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "27",
        "lng": "114.294441",
        "lat": "30.582595",
        "name": "武汉市少年儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "28",
        "lng": "114.373129",
        "lat": "30.578505",
        "name": "武汉纺织大学东湖校区图书馆(求知路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "29",
        "lng": "114.308362",
        "lat": "30.509387",
        "name": "红旗·九里少儿图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "30",
        "lng": "114.291664",
        "lat": "30.583483",
        "name": "江岸区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "31",
        "lng": "114.314003",
        "lat": "30.538707",
        "name": "中南财经政法大学首义校区MBA学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "32",
        "lng": "114.316304",
        "lat": "30.532624",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "33",
        "lng": "114.313046",
        "lat": "30.536828",
        "name": "中南财经政法大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "34",
        "lng": "114.327644",
        "lat": "30.503395",
        "name": "悠贝亲子图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "35",
        "lng": "114.401543",
        "lat": "30.492729",
        "name": "清觅自习室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "36",
        "lng": "114.357673",
        "lat": "30.604761",
        "name": "武汉理工大学余家头校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "37",
        "lng": "114.310387",
        "lat": "30.610705",
        "name": "悠贝绘本馆图书馆(武汉天地壹方购物中心店)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "38",
        "lng": "114.286523",
        "lat": "30.588194",
        "name": "24小时自助图书馆(解放大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "39",
        "lng": "114.366238",
        "lat": "30.524329",
        "name": "武汉电力职业技术学院图书馆(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "40",
        "lng": "114.343919",
        "lat": "30.51296",
        "name": "武汉理工大学图书馆信息分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "41",
        "lng": "114.339376",
        "lat": "30.54418",
        "name": "湖北科教大厦-阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "42",
        "lng": "114.391221",
        "lat": "30.502581",
        "name": "武汉工程大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "43",
        "lng": "114.292513",
        "lat": "30.490587",
        "name": "湖北省图书馆(复地悦城分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "44",
        "lng": "114.336416",
        "lat": "30.498332",
        "name": "24小时自助图书馆(书城路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "45",
        "lng": "114.357395",
        "lat": "30.471634",
        "name": "华中农业大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "46",
        "lng": "114.291554",
        "lat": "30.583407",
        "name": "江岸区少儿图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "47",
        "lng": "114.389608",
        "lat": "30.605656",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "48",
        "lng": "114.412059",
        "lat": "30.512715",
        "name": "华中科技大学图书馆(新馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "49",
        "lng": "114.277952",
        "lat": "30.627575",
        "name": "汉口图书大世界",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "50",
        "lng": "114.30726",
        "lat": "30.480019",
        "name": "湖北工业大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "51",
        "lng": "114.257519",
        "lat": "30.569703",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "52",
        "lng": "114.3482",
        "lat": "30.58525",
        "name": "武汉铁路局党校-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "53",
        "lng": "114.278221",
        "lat": "30.549469",
        "name": "24小时自助图书馆(拦江路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "54",
        "lng": "114.397415",
        "lat": "30.494097",
        "name": "24小时自助图书馆(民族大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "55",
        "lng": "114.391669",
        "lat": "30.487097",
        "name": "中南民族大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "56",
        "lng": "114.259196",
        "lat": "30.547268",
        "name": "翠微新城社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "57",
        "lng": "114.286092",
        "lat": "30.481194",
        "name": "武昌工学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "58",
        "lng": "114.270774",
        "lat": "30.60313",
        "name": "江汉区图书馆(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "59",
        "lng": "114.385001",
        "lat": "30.473913",
        "name": "中南财经政法大学南湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "60",
        "lng": "114.291085",
        "lat": "30.613256",
        "name": "小钰米少儿英文图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "61",
        "lng": "114.369333",
        "lat": "30.623827",
        "name": "武汉科技大学图书馆(武冶小区东南)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "62",
        "lng": "114.370623",
        "lat": "30.511923",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "63",
        "lng": "114.293162",
        "lat": "30.535658",
        "name": "武汉大学医学职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "64",
        "lng": "114.411889",
        "lat": "30.51201",
        "name": "华中科技大学图书馆(老馆)(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "65",
        "lng": "114.425766",
        "lat": "30.586219",
        "name": "武汉城市学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "66",
        "lng": "114.327542",
        "lat": "30.504204",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "67",
        "lng": "114.303383",
        "lat": "30.604252",
        "name": "武汉市少儿图书馆(四唯路分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "68",
        "lng": "114.368568",
        "lat": "30.584002",
        "name": "武汉地铁自助图书馆(铁机路地铁站点)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "69",
        "lng": "114.260437",
        "lat": "30.54664",
        "name": "武汉归元正藏图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "70",
        "lng": "114.298985",
        "lat": "30.515716",
        "name": "湖北财税职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "71",
        "lng": "114.392317",
        "lat": "30.487934",
        "name": "中南民族大学北书院",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "72",
        "lng": "114.372601",
        "lat": "30.508816",
        "name": "湖北交通职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "73",
        "lng": "114.291663",
        "lat": "30.583469",
        "name": "江岸区少年儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "74",
        "lng": "114.362895",
        "lat": "30.535781",
        "name": "武汉大学珞珈文库",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "75",
        "lng": "114.292104",
        "lat": "30.567028",
        "name": "24小时自助图书馆(沿江大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "76",
        "lng": "114.377858",
        "lat": "30.500553",
        "name": "湖北商贸学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "77",
        "lng": "114.260412",
        "lat": "30.581152",
        "name": "华中科技大学同济医学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "78",
        "lng": "114.389125",
        "lat": "30.632071",
        "name": "武汉市青山区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "79",
        "lng": "114.2827",
        "lat": "30.603292",
        "name": "24小时自助图书馆(建设大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "80",
        "lng": "114.37425",
        "lat": "30.627781",
        "name": "乌龟国会员制家庭图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "81",
        "lng": "114.432433",
        "lat": "30.510472",
        "name": "华中科技大学东校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "82",
        "lng": "114.399082",
        "lat": "30.485908",
        "name": "武汉纺织大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "83",
        "lng": "114.356519",
        "lat": "30.525407",
        "name": "东境声音图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "84",
        "lng": "114.406142",
        "lat": "30.474185",
        "name": "24小时自助图书馆(软件园东路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "85",
        "lng": "114.273476",
        "lat": "30.45886",
        "name": "武汉工商学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "86",
        "lng": "114.344007",
        "lat": "30.512915",
        "name": "武汉理工大学鉴湖校区图书馆信息分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "87",
        "lng": "114.440597",
        "lat": "30.49366",
        "name": "文华学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "88",
        "lng": "114.300965",
        "lat": "30.617247",
        "name": "加州幼儿园-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "89",
        "lng": "114.205167",
        "lat": "30.552129",
        "name": "人信汇海豚儿童图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "90",
        "lng": "114.327176",
        "lat": "30.577784",
        "name": "武汉航海职业技术学院图书馆(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "91",
        "lng": "114.400081",
        "lat": "30.457421",
        "name": "书小鱼·共享图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "92",
        "lng": "114.206903",
        "lat": "30.505149",
        "name": "悠贝亲子图书馆(经开永旺美吉姆馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "93",
        "lng": "114.413354",
        "lat": "30.484544",
        "name": "武汉职业技术学院东区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "94",
        "lng": "114.262545",
        "lat": "30.58468",
        "name": "万松街社区图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "95",
        "lng": "114.433128",
        "lat": "30.460711",
        "name": "武汉工程大学流芳校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "96",
        "lng": "114.379715",
        "lat": "30.474338",
        "name": "中南财经政法大学南湖校区图书馆(明德路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "97",
        "lng": "114.428752",
        "lat": "30.443539",
        "name": "武汉软件工程职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "98",
        "lng": "114.247874",
        "lat": "30.550683",
        "name": "五园里社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "99",
        "lng": "114.303725",
        "lat": "30.694442",
        "name": "悠贝亲子图书馆·盘龙城万达馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "100",
        "lng": "114.361316",
        "lat": "30.418056",
        "name": "武昌理工学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "101",
        "lng": "114.317371",
        "lat": "30.423975",
        "name": "武汉东湖学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "102",
        "lng": "114.371865",
        "lat": "30.578276",
        "name": "武汉光谷职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "103",
        "lng": "114.450092",
        "lat": "30.480851",
        "name": "湖北第二师范学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "104",
        "lng": "114.193156",
        "lat": "30.628698",
        "name": "悠贝亲子图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "105",
        "lng": "114.420501",
        "lat": "30.437014",
        "name": "武汉传媒学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "106",
        "lng": "114.43621",
        "lat": "30.417617",
        "name": "湖北经济学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "107",
        "lng": "114.214091",
        "lat": "30.588353",
        "name": "武汉图书馆军休三中心共建图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "108",
        "lng": "114.476467",
        "lat": "30.481592",
        "name": "24小时自助图书馆(二妃山庄前厅部西南)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "109",
        "lng": "114.270667",
        "lat": "30.448068",
        "name": "湖北中医药大学黄家湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "110",
        "lng": "114.269449",
        "lat": "30.632814",
        "name": "24小时自助图书馆(后湖大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "111",
        "lng": "114.40509",
        "lat": "30.632257",
        "name": "24小时自助图书馆(沿港路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "112",
        "lng": "114.315048",
        "lat": "30.510424",
        "name": "武汉市少儿图书馆南湖街分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "113",
        "lng": "114.265617",
        "lat": "30.428837",
        "name": "武汉交通职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "114",
        "lng": "114.162542",
        "lat": "30.504865",
        "name": "悠贝亲子图书馆(经开文汐素质成长中心)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "115",
        "lng": "114.404359",
        "lat": "30.640249",
        "name": "24小时自助图书馆(和平大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "116",
        "lng": "114.376407",
        "lat": "30.403695",
        "name": "武汉信息传播职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "117",
        "lng": "114.266933",
        "lat": "30.437754",
        "name": "武汉科技大学图书馆(黄家湖西路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "118",
        "lng": "114.372788",
        "lat": "30.689201",
        "name": "湖北大学知行学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "119",
        "lng": "114.212216",
        "lat": "30.598284",
        "name": "24小时自助图书馆(南泥湾大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "120",
        "lng": "114.255704",
        "lat": "30.649501",
        "name": "将军路文化广场图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "121",
        "lng": "114.391924",
        "lat": "30.529708",
        "name": "中国数字图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "122",
        "lng": "114.222509",
        "lat": "30.652311",
        "name": "武汉轻工大学金银湖校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "123",
        "lng": "114.158517",
        "lat": "30.514117",
        "name": "江汉大学-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "124",
        "lng": "114.299834",
        "lat": "30.57917",
        "name": "自助图书馆(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "125",
        "lng": "114.235393",
        "lat": "30.637623",
        "name": "武汉轻工大学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "126",
        "lng": "114.359738",
        "lat": "30.593289",
        "name": "书小鱼·共享图书馆(保利馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "127",
        "lng": "114.234834",
        "lat": "30.566869",
        "name": "武汉船舶职业技术学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "128",
        "lng": "114.277007",
        "lat": "30.549492",
        "name": "莲花湖社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "129",
        "lng": "114.308224",
        "lat": "30.594845",
        "name": "武汉图书馆24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "130",
        "lng": "114.162653",
        "lat": "30.468622",
        "name": "汤湖图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "131",
        "lng": "114.410336",
        "lat": "30.468171",
        "name": "武汉华夏理工学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "132",
        "lng": "114.226682",
        "lat": "30.580722",
        "name": "武汉图书馆24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "133",
        "lng": "114.25728",
        "lat": "30.611976",
        "name": "Wuhan Library24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "134",
        "lng": "114.300316",
        "lat": "30.598348",
        "name": "浪丘英语图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "135",
        "lng": "114.415185",
        "lat": "30.5415",
        "name": "德善公益图书馆大李村书屋",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "136",
        "lng": "114.456588",
        "lat": "30.579928",
        "name": "武汉市青少年儿童图书馆武东分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "137",
        "lng": "114.26799",
        "lat": "30.55966",
        "name": "江汉桥社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "138",
        "lng": "114.316982",
        "lat": "30.415216",
        "name": "汉口学院-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "139",
        "lng": "114.308835",
        "lat": "30.486291",
        "name": "武昌首义学院南区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "140",
        "lng": "114.226634",
        "lat": "30.599617",
        "name": "发展社区-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "141",
        "lng": "114.24595",
        "lat": "30.628489",
        "name": "全英图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "142",
        "lng": "114.264952",
        "lat": "30.570691",
        "name": "硚口区城市管理(执法)局离退休干部党支部阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "143",
        "lng": "114.338366",
        "lat": "30.377402",
        "name": "武汉纺织大学阳光校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "144",
        "lng": "114.300936",
        "lat": "30.607654",
        "name": "解放公园-24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "145",
        "lng": "114.419554",
        "lat": "30.701222",
        "name": "眼镜图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "146",
        "lng": "114.324087",
        "lat": "30.357122",
        "name": "江夏区青少年读书馆(新华书店分店)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "147",
        "lng": "114.200532",
        "lat": "30.59498",
        "name": "24小时自助图书馆(解放大道)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "148",
        "lng": "114.153244",
        "lat": "30.489539",
        "name": "24小时自助图书馆(联城路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "149",
        "lng": "114.461106",
        "lat": "30.436226",
        "name": "武汉商贸职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "150",
        "lng": "114.365014",
        "lat": "30.620114",
        "name": "图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "151",
        "lng": "114.41619",
        "lat": "30.696431",
        "name": "中国梦图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "152",
        "lng": "114.139381",
        "lat": "30.62539",
        "name": "武汉市东西湖区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "153",
        "lng": "114.398885",
        "lat": "30.48606",
        "name": "图书馆信息服务中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "154",
        "lng": "114.379489",
        "lat": "30.4745",
        "name": "中南财经政法大学南湖校区图书阅览中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "155",
        "lng": "114.417375",
        "lat": "30.392372",
        "name": "湖北美术学院藏龙岛校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "156",
        "lng": "114.254779",
        "lat": "30.572884",
        "name": "悠贝亲子图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "157",
        "lng": "114.388142",
        "lat": "30.474631",
        "name": "中南财经政法大学南湖校区法学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "158",
        "lng": "114.314775",
        "lat": "30.347088",
        "name": "江夏区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "159",
        "lng": "114.191652",
        "lat": "30.460311",
        "name": "(汉南区)文化馆图书馆沌口街分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "160",
        "lng": "114.153026",
        "lat": "30.4896",
        "name": "沌阳街文体事业服务中心图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "161",
        "lng": "114.268674",
        "lat": "30.601284",
        "name": "江汉区图书馆金桥书院(暂停营业)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "162",
        "lng": "114.424021",
        "lat": "30.703096",
        "name": "文体图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "163",
        "lng": "114.150724",
        "lat": "30.628949",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "164",
        "lng": "114.171949",
        "lat": "30.661641",
        "name": "诺丁图书阅读室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "165",
        "lng": "114.390561",
        "lat": "30.471591",
        "name": "红色中南党史阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "166",
        "lng": "114.035953",
        "lat": "30.576905",
        "name": "武汉市蔡甸区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "167",
        "lng": "114.159257",
        "lat": "30.512648",
        "name": "江汉大学法学院资料室阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "168",
        "lng": "114.087571",
        "lat": "30.462508",
        "name": "武汉商学院北区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "169",
        "lng": "114.527889",
        "lat": "30.713001",
        "name": "武汉生物工程学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "170",
        "lng": "114.375325",
        "lat": "30.628925",
        "name": "Inco.英语图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "171",
        "lng": "114.370334",
        "lat": "30.870181",
        "name": "黄陂图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "172",
        "lng": "114.406083",
        "lat": "30.371385",
        "name": "湖北水利水电职业技术学院-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "173",
        "lng": "114.314702",
        "lat": "30.351562",
        "name": "24小时自助图书馆(熊廷弼街)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "174",
        "lng": "114.139415",
        "lat": "30.625359",
        "name": "东西湖区总工会职工阅览中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "175",
        "lng": "114.139567",
        "lat": "30.625302",
        "name": "湖北作家文献中心",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "176",
        "lng": "114.730851",
        "lat": "30.538248",
        "name": "鄂州市华容图书馆",
        "cityname": "鄂州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "177",
        "lng": "114.287061",
        "lat": "30.62468",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "178",
        "lng": "114.413417",
        "lat": "30.472721",
        "name": "悠贝",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "179",
        "lng": "114.384972",
        "lat": "30.457017",
        "name": "书小鱼共享图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "180",
        "lng": "114.028936",
        "lat": "30.529199",
        "name": "长江大学武汉校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "181",
        "lng": "114.07487",
        "lat": "30.461658",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "182",
        "lng": "114.618256",
        "lat": "30.456304",
        "name": "中国地质大学未来城校区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "183",
        "lng": "114.249247",
        "lat": "30.613617",
        "name": "银河里社区电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "184",
        "lng": "114.226563",
        "lat": "30.580858",
        "name": "武汉市第十七中学24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "185",
        "lng": "114.218724",
        "lat": "30.559278",
        "name": "武汉地铁自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "186",
        "lng": "114.448756",
        "lat": "30.490095",
        "name": "湖北体育职业学院电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "187",
        "lng": "114.209566",
        "lat": "30.565625",
        "name": "玫瑰西园社区图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "188",
        "lng": "114.437738",
        "lat": "30.464612",
        "name": "武汉市仪表电子学校图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "189",
        "lng": "114.3241",
        "lat": "30.357032",
        "name": "江夏区图书馆青少年分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "190",
        "lng": "114.085243",
        "lat": "30.31216",
        "name": "武汉市汉南区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "191",
        "lng": "114.136971",
        "lat": "30.675372",
        "name": "网安学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "192",
        "lng": "114.132638",
        "lat": "30.624393",
        "name": "武汉图书馆24小时自助图书馆(六顺路)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "193",
        "lng": "114.244914",
        "lat": "30.647235",
        "name": "武汉市常青树实验学校图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "194",
        "lng": "114.086591",
        "lat": "30.315518",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "195",
        "lng": "114.330279",
        "lat": "30.354975",
        "name": "公益图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "196",
        "lng": "114.335981",
        "lat": "30.344181",
        "name": "湖北生态工程职业技术学院网络电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "197",
        "lng": "114.184854",
        "lat": "30.494234",
        "name": "图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "198",
        "lng": "114.035792",
        "lat": "30.576862",
        "name": "新华书店图书馆活动展览厅",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "199",
        "lng": "114.026828",
        "lat": "30.579306",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "200",
        "lng": "114.172892",
        "lat": "30.499789",
        "name": "海豚儿童阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "201",
        "lng": "114.191617",
        "lat": "30.460247",
        "name": "图书·电子阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "202",
        "lng": "114.092892",
        "lat": "30.352698",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "203",
        "lng": "114.407906",
        "lat": "30.400612",
        "name": "武汉设计工程学院新图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "204",
        "lng": "114.409308",
        "lat": "30.401009",
        "name": "武汉设计工程学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "205",
        "lng": "114.433917",
        "lat": "30.398826",
        "name": "武汉体育学院体育科技学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "206",
        "lng": "114.417891",
        "lat": "30.385707",
        "name": "武汉纺织大学外经贸学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "207",
        "lng": "113.838809",
        "lat": "30.64422",
        "name": "汉川市图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "208",
        "lng": "114.88881",
        "lat": "30.43008",
        "name": "学府书店",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "209",
        "lng": "114.908332",
        "lat": "30.432191",
        "name": "黄冈市图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "210",
        "lng": "114.708748",
        "lat": "30.774193",
        "name": "新洲职高图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "211",
        "lng": "114.801935",
        "lat": "30.843898",
        "name": "新洲区图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "212",
        "lng": "113.841418",
        "lat": "30.662344",
        "name": "汉江书房祥和分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "213",
        "lng": "113.959256",
        "lat": "30.914715",
        "name": "孝感市图书馆新馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "214",
        "lng": "115.020302",
        "lat": "30.185371",
        "name": "野兽国图书馆(湿地公园店)",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "215",
        "lng": "114.886275",
        "lat": "30.382194",
        "name": "鄂州市图书馆新馆",
        "cityname": "鄂州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "216",
        "lng": "114.398968",
        "lat": "30.371143",
        "name": "武昌职业学院图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "217",
        "lng": "114.329365",
        "lat": "30.357633",
        "name": "24小时自助图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "218",
        "lng": "114.12823",
        "lat": "30.625178",
        "name": "武汉警官职业学院(东西湖校区)-图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "219",
        "lng": "113.914703",
        "lat": "30.937225",
        "name": "湖北工程学院图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "220",
        "lng": "114.558122",
        "lat": "30.459552",
        "name": "豹澥图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "221",
        "lng": "114.874709",
        "lat": "30.455911",
        "name": "黄州区图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "222",
        "lng": "114.547797",
        "lat": "30.713918",
        "name": "武汉工程职业技术学院图书馆服务部",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "223",
        "lng": "114.871384",
        "lat": "30.640239",
        "name": "团风县图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "224",
        "lng": "114.035892",
        "lat": "30.576792",
        "name": "汉阳县图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "225",
        "lng": "115.090227",
        "lat": "30.214627",
        "name": "黄石港区图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "226",
        "lng": "115.04375",
        "lat": "30.196574",
        "name": "黄石市图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "227",
        "lng": "115.068964",
        "lat": "30.195063",
        "name": "绘本TAXI儿童连锁图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "228",
        "lng": "114.892979",
        "lat": "30.452147",
        "name": "黄冈科技职业学院图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "229",
        "lng": "114.679679",
        "lat": "30.523932",
        "name": "图书馆",
        "cityname": "鄂州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "230",
        "lng": "113.774447",
        "lat": "31.014553",
        "name": "云梦县图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "231",
        "lng": "114.314674",
        "lat": "29.857161",
        "name": "咸宁市图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "232",
        "lng": "114.974823",
        "lat": "30.102659",
        "name": "大冶市图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "233",
        "lng": "115.024826",
        "lat": "30.21158",
        "name": "湖北理工学院图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "234",
        "lng": "114.076585",
        "lat": "30.313434",
        "name": "武汉市汉南区纱帽中学图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "235",
        "lng": "114.084452",
        "lat": "30.306059",
        "name": "武汉经济技术开发区(汉南区)文化馆图书馆纱帽街分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "236",
        "lng": "114.895317",
        "lat": "30.3756",
        "name": "鄂州职业大学图书馆",
        "cityname": "鄂州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "237",
        "lng": "114.950784",
        "lat": "30.176333",
        "name": "黄石市铜都小学-下陆图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "238",
        "lng": "114.616722",
        "lat": "31.282173",
        "name": "红安县图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "239",
        "lng": "114.285466",
        "lat": "29.871492",
        "name": "咸宁市咸安区图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "240",
        "lng": "114.378257",
        "lat": "30.891096",
        "name": "图书阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "241",
        "lng": "113.931832",
        "lat": "29.96197",
        "name": "湖北省嘉鱼县图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "242",
        "lng": "113.930913",
        "lat": "30.907671",
        "name": "孝感市孝南区图书馆(暂停营业)",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "243",
        "lng": "114.974855",
        "lat": "30.102647",
        "name": "大冶市图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "244",
        "lng": "113.585353",
        "lat": "30.940966",
        "name": "应城市图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "245",
        "lng": "115.026731",
        "lat": "30.184244",
        "name": "湖北工程职业学院图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "246",
        "lng": "114.600983",
        "lat": "30.833142",
        "name": "武汉市新洲区图书馆仓埠分馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "247",
        "lng": "114.338183",
        "lat": "29.848778",
        "name": "湖北科技学院图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "248",
        "lng": "113.993582",
        "lat": "31.254781",
        "name": "孝昌县图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "249",
        "lng": "113.81676",
        "lat": "30.449217",
        "name": "武汉市蔡甸区侏儒街中刘村图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "250",
        "lng": "115.065452",
        "lat": "30.23021",
        "name": "湖北师范大学图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "251",
        "lng": "114.299997",
        "lat": "30.917835",
        "name": "武汉图书馆·金寨村共建图书室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "252",
        "lng": "115.262945",
        "lat": "30.463395",
        "name": "浠水图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "253",
        "lng": "113.454105",
        "lat": "30.360433",
        "name": "仙桃市图书馆",
        "cityname": "仙桃市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "254",
        "lng": "114.746108",
        "lat": "30.371573",
        "name": "鄂州市东港社区残疾人励志书屋",
        "cityname": "鄂州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "255",
        "lng": "113.821633",
        "lat": "30.219703",
        "name": "汉南农场螃蟹养殖协会阅览室",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "256",
        "lng": "115.001084",
        "lat": "31.163901",
        "name": "麻城市图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "257",
        "lng": "114.974732",
        "lat": "31.162004",
        "name": "麻城法院图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "258",
        "lng": "114.519672",
        "lat": "31.148657",
        "name": "李先念故居图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "259",
        "lng": "114.27122",
        "lat": "29.865084",
        "name": "湖北科技学院咸安校区图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "260",
        "lng": "115.106003",
        "lat": "30.642404",
        "name": "马家潭水文站图书阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "261",
        "lng": "115.090338",
        "lat": "30.214781",
        "name": "黄石市图书馆(黄石市文化市场综合执法支队西北)",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "262",
        "lng": "111.315601",
        "lat": "30.677392",
        "name": "宜昌市图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "263",
        "lng": "114.298118",
        "lat": "31.288782",
        "name": "图书馆",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "264",
        "lng": "113.584142",
        "lat": "30.932734",
        "name": "应城市图书馆宇洋分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "265",
        "lng": "113.832837",
        "lat": "30.560745",
        "name": "幼儿童图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "266",
        "lng": "111.765947",
        "lat": "30.174365",
        "name": "悠贝阅读中心(松滋玉岭花园馆)",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "267",
        "lng": "113.905592",
        "lat": "29.731644",
        "name": "赤壁图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "268",
        "lng": "113.447661",
        "lat": "30.359931",
        "name": "东壁图书所",
        "cityname": "仙桃市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "269",
        "lng": "111.315403",
        "lat": "30.72414",
        "name": "三峡大学图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "270",
        "lng": "112.712278",
        "lat": "29.973282",
        "name": "监利东方爱婴早教中心",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "271",
        "lng": "112.264447",
        "lat": "30.328291",
        "name": "荆州新图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "272",
        "lng": "112.152792",
        "lat": "32.045398",
        "name": "城市书房(星火书房)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "273",
        "lng": "111.421864",
        "lat": "30.402283",
        "name": "宜都市图书馆(新馆)",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "274",
        "lng": "112.224178",
        "lat": "32.061411",
        "name": "襄阳市图书馆(东津新馆)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "275",
        "lng": "110.334973",
        "lat": "31.039648",
        "name": "楚天路图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "276",
        "lng": "113.146882",
        "lat": "30.990627",
        "name": "京山市图书馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "277",
        "lng": "109.468683",
        "lat": "30.266277",
        "name": "恩施书房(恩施州图书馆书院分馆)",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "278",
        "lng": "115.986898",
        "lat": "29.752011",
        "name": "小书虫AI阅读馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "279",
        "lng": "113.141543",
        "lat": "30.649813",
        "name": "天门市图书馆",
        "cityname": "天门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "280",
        "lng": "109.487936",
        "lat": "30.275268",
        "name": "恩施州图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "281",
        "lng": "115.956533",
        "lat": "30.095155",
        "name": "黄梅县图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "282",
        "lng": "112.106032",
        "lat": "31.996639",
        "name": "城市书房(营盘书房)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "283",
        "lng": "114.866494",
        "lat": "30.643339",
        "name": "残疾人阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "284",
        "lng": "114.867893",
        "lat": "30.638005",
        "name": "团风镇综合文化站图书室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "285",
        "lng": "114.867953",
        "lat": "30.638008",
        "name": "团风镇综合文化站图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "286",
        "lng": "113.970275",
        "lat": "30.884051",
        "name": "孝南区图书馆开发区分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "287",
        "lng": "115.412815",
        "lat": "30.807373",
        "name": "罗田县图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "288",
        "lng": "114.874071",
        "lat": "30.449613",
        "name": "图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "289",
        "lng": "114.341682",
        "lat": "31.018",
        "name": "武汉市少年儿童图书馆(联合村分馆)",
        "cityname": "武汉市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "290",
        "lng": "111.337063",
        "lat": "30.754058",
        "name": "宜昌市夷陵区图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "291",
        "lng": "114.892214",
        "lat": "30.450087",
        "name": "黄冈科技职业学院电子阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "292",
        "lng": "115.217653",
        "lat": "29.869591",
        "name": "阳新图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "293",
        "lng": "111.745369",
        "lat": "30.164447",
        "name": "松滋市图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "294",
        "lng": "113.776014",
        "lat": "30.497928",
        "name": "汉川市图书馆南河乡分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "295",
        "lng": "115.421783",
        "lat": "30.219694",
        "name": "蕲春县图书馆(新址)",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "296",
        "lng": "112.211261",
        "lat": "30.351309",
        "name": "荆州市图书馆(古城分馆)",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "297",
        "lng": "113.687589",
        "lat": "31.257755",
        "name": "安陆图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "298",
        "lng": "110.781262",
        "lat": "32.655682",
        "name": "十堰市图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "299",
        "lng": "114.925328",
        "lat": "30.474814",
        "name": "图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "300",
        "lng": "113.922234",
        "lat": "30.910136",
        "name": "孝感市文化中心图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "301",
        "lng": "111.282231",
        "lat": "30.705844",
        "name": "宜昌市西陵区图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "302",
        "lng": "112.107512",
        "lat": "31.998813",
        "name": "襄阳市图书馆(襄城分馆)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "303",
        "lng": "112.186789",
        "lat": "32.079196",
        "name": "襄州区图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "304",
        "lng": "113.923992",
        "lat": "30.93648",
        "name": "孝感市孝南区图书馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "305",
        "lng": "115.593558",
        "lat": "29.871538",
        "name": "武穴市图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "306",
        "lng": "111.439138",
        "lat": "30.541022",
        "name": "猇亭区图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "307",
        "lng": "113.367731",
        "lat": "31.715213",
        "name": "随州市图书馆",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "308",
        "lng": "109.479789",
        "lat": "30.278902",
        "name": "恩施市图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "309",
        "lng": "112.213102",
        "lat": "30.334289",
        "name": "长江大学东校区图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "310",
        "lng": "113.464902",
        "lat": "29.814826",
        "name": "洪湖图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "311",
        "lng": "112.76422",
        "lat": "32.112296",
        "name": "枣阳市图书馆(光武路)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "312",
        "lng": "112.89906",
        "lat": "30.420289",
        "name": "潜江图书馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "313",
        "lng": "112.232463",
        "lat": "30.058368",
        "name": "公安县图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "314",
        "lng": "114.899241",
        "lat": "30.201642",
        "name": "铁山图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "315",
        "lng": "112.179057",
        "lat": "32.108556",
        "name": "城市书房(车城书房)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "316",
        "lng": "112.199596",
        "lat": "32.084622",
        "name": "城市书房(浩然书房)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "317",
        "lng": "113.141538",
        "lat": "30.649839",
        "name": "天门市万林图书馆",
        "cityname": "天门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "318",
        "lng": "113.81682",
        "lat": "29.241733",
        "name": "通城县图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "319",
        "lng": "114.763078",
        "lat": "30.070182",
        "name": "大冶市图书馆茗山分馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "320",
        "lng": "113.694026",
        "lat": "30.774041",
        "name": "汉川市图书馆麻河镇分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "321",
        "lng": "110.334931",
        "lat": "31.039651",
        "name": "巴东县图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "322",
        "lng": "111.725064",
        "lat": "30.413271",
        "name": "枝江市图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "323",
        "lng": "113.416545",
        "lat": "31.687949",
        "name": "随州市图书馆(书寓分馆)",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "324",
        "lng": "112.114653",
        "lat": "32.041721",
        "name": "樊城区图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "325",
        "lng": "111.768576",
        "lat": "30.173593",
        "name": "神奇世界",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "326",
        "lng": "110.736842",
        "lat": "32.6517",
        "name": "逸夫图书馆(湖北汽车工业学院)",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "327",
        "lng": "109.469097",
        "lat": "30.266019",
        "name": "恩施州图书馆(书院分馆)",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "328",
        "lng": "115.211994",
        "lat": "29.840122",
        "name": "绘本taxi儿童连锁图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "329",
        "lng": "113.950078",
        "lat": "31.07434",
        "name": "孝感市孝南区图书馆肖港分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "330",
        "lng": "112.857092",
        "lat": "30.191033",
        "name": "潜江市图书馆老新分馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "331",
        "lng": "115.936016",
        "lat": "30.072915",
        "name": "黄梅县图书馆嘉隆图书室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "332",
        "lng": "112.201294",
        "lat": "30.9761",
        "name": "文昌阁藏书楼",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "333",
        "lng": "113.603958",
        "lat": "30.494781",
        "name": "汉川市图书馆脉旺镇分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "334",
        "lng": "110.781186",
        "lat": "32.655563",
        "name": "十堰市六堰图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "335",
        "lng": "114.972192",
        "lat": "30.196024",
        "name": "湖北省图书馆(东方山分馆)",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "336",
        "lng": "111.86077",
        "lat": "31.785634",
        "name": "南漳县图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "337",
        "lng": "114.276665",
        "lat": "29.875733",
        "name": "快读图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "338",
        "lng": "108.948777",
        "lat": "30.284484",
        "name": "利川市图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "339",
        "lng": "115.02454",
        "lat": "30.210486",
        "name": "湖北理工学院图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "340",
        "lng": "111.207171",
        "lat": "30.472035",
        "name": "长阳图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "341",
        "lng": "112.184173",
        "lat": "30.354511",
        "name": "荆州市荆州区图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "342",
        "lng": "114.487919",
        "lat": "29.873073",
        "name": "高桥镇澄水洞村图书室",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "343",
        "lng": "110.79031",
        "lat": "32.615312",
        "name": "汉江师范学院图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "344",
        "lng": "115.087582",
        "lat": "30.79454",
        "name": "贾庙综合文化站图书电子阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "345",
        "lng": "110.974613",
        "lat": "30.820591",
        "name": "秭归县图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "346",
        "lng": "113.832525",
        "lat": "31.617339",
        "name": "广水市图书馆",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "347",
        "lng": "111.075254",
        "lat": "30.156355",
        "name": "五峰县新图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "348",
        "lng": "113.898422",
        "lat": "29.96973",
        "name": "嘉鱼县图书馆鱼岳镇分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "349",
        "lng": "111.641091",
        "lat": "31.060563",
        "name": "远安县图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "350",
        "lng": "113.742659",
        "lat": "31.02075",
        "name": "兆椿书房实验小学分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "351",
        "lng": "113.747841",
        "lat": "31.026949",
        "name": "云梦县图书馆城关镇分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "352",
        "lng": "111.50014",
        "lat": "32.550643",
        "name": "丹江口市图书馆均州书房",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "353",
        "lng": "110.428051",
        "lat": "32.98862",
        "name": "郧西县图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "354",
        "lng": "114.973033",
        "lat": "30.101606",
        "name": "矿尾图书馆",
        "cityname": "黄石市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "355",
        "lng": "111.674106",
        "lat": "32.385119",
        "name": "图书馆(市府路)",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "356",
        "lng": "110.80966",
        "lat": "32.836834",
        "name": "郧阳区图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "357",
        "lng": "112.193636",
        "lat": "31.044118",
        "name": "荆楚理工学院-图书馆(荆门市安全生产委员会西)",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "358",
        "lng": "110.736691",
        "lat": "32.651703",
        "name": "湖北汽车工业学院-逸夫图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "359",
        "lng": "113.164608",
        "lat": "30.661469",
        "name": "体育中心24小时免费悦读驿站",
        "cityname": "天门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "360",
        "lng": "114.315883",
        "lat": "29.826203",
        "name": "咸宁职业技术学院-教院图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "361",
        "lng": "113.823869",
        "lat": "29.263641",
        "name": "玉立图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "362",
        "lng": "110.674032",
        "lat": "31.746112",
        "name": "神农架林区图书馆",
        "cityname": "神农架林区",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "363",
        "lng": "112.201494",
        "lat": "30.333204",
        "name": "荆州职业技术学院图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "364",
        "lng": "114.589739",
        "lat": "31.258282",
        "name": "红安县图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "365",
        "lng": "111.30763",
        "lat": "30.706716",
        "name": "三峡电力职业学院图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "366",
        "lng": "111.808582",
        "lat": "30.821788",
        "name": "当阳图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "367",
        "lng": "112.190821",
        "lat": "30.973341",
        "name": "荆门市掇刀区图书馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "368",
        "lng": "112.207042",
        "lat": "31.076249",
        "name": "东宝区图书馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "369",
        "lng": "112.273653",
        "lat": "31.714403",
        "name": "宜城市图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "370",
        "lng": "112.247093",
        "lat": "30.310013",
        "name": "沙市区图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "371",
        "lng": "114.489996",
        "lat": "29.602415",
        "name": "通山县图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "372",
        "lng": "112.156689",
        "lat": "32.043524",
        "name": "襄阳市图书馆芝士分馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "373",
        "lng": "111.628981",
        "lat": "32.263763",
        "name": "谷城图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "374",
        "lng": "113.453747",
        "lat": "30.360558",
        "name": "沙嘴街道图书馆",
        "cityname": "仙桃市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "375",
        "lng": "112.57933",
        "lat": "30.702055",
        "name": "沙洋县图书馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "376",
        "lng": "115.674038",
        "lat": "30.741188",
        "name": "英山县图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "377",
        "lng": "112.898875",
        "lat": "30.420352",
        "name": "曹禺图书馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "378",
        "lng": "109.500969",
        "lat": "30.294483",
        "name": "湖北民族大学图书馆(老馆)",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "379",
        "lng": "115.555158",
        "lat": "29.845896",
        "name": "武穴市图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "380",
        "lng": "113.365139",
        "lat": "31.714495",
        "name": "曾都区图书馆",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "381",
        "lng": "109.727764",
        "lat": "30.60251",
        "name": "建始县图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "382",
        "lng": "109.133647",
        "lat": "29.669089",
        "name": "图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "383",
        "lng": "112.587775",
        "lat": "31.166596",
        "name": "湖北省钟祥市图书馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "384",
        "lng": "110.784887",
        "lat": "32.622783",
        "name": "湖北医药学院图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "385",
        "lng": "109.736645",
        "lat": "32.321622",
        "name": "竹溪县图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "386",
        "lng": "113.395941",
        "lat": "31.68687",
        "name": "随州市图书馆最好的时光分馆",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "387",
        "lng": "112.247067",
        "lat": "30.310022",
        "name": "荆州市少年儿童图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "388",
        "lng": "112.102263",
        "lat": "32.057085",
        "name": "襄阳市图书馆流动图书站",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "389",
        "lng": "111.258242",
        "lat": "31.876966",
        "name": "保康图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "390",
        "lng": "110.235095",
        "lat": "32.213878",
        "name": "竹山县图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "391",
        "lng": "114.042992",
        "lat": "29.543642",
        "name": "崇阳县图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "392",
        "lng": "113.298801",
        "lat": "31.87118",
        "name": "随县图书馆",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "393",
        "lng": "111.315337",
        "lat": "30.677088",
        "name": "宜昌市盲人图书室",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "394",
        "lng": "112.171318",
        "lat": "30.332757",
        "name": "湖北中医药高等专科学校图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "395",
        "lng": "110.787378",
        "lat": "32.638432",
        "name": "绘本图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "396",
        "lng": "111.784263",
        "lat": "30.168522",
        "name": "杏花村社区图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "397",
        "lng": "111.632531",
        "lat": "32.259558",
        "name": "谷城劝学图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "398",
        "lng": "112.185958",
        "lat": "30.351009",
        "name": "长江大学文理学院图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "399",
        "lng": "112.205335",
        "lat": "32.090345",
        "name": "田家炳图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "400",
        "lng": "110.033281",
        "lat": "29.889992",
        "name": "鹤峰县图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "401",
        "lng": "115.436759",
        "lat": "30.247851",
        "name": "李时珍中医药图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "402",
        "lng": "112.596408",
        "lat": "30.991555",
        "name": "钟祥市图书馆柴湖分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "403",
        "lng": "110.790464",
        "lat": "32.663389",
        "name": "七里社区图书阅览室",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "404",
        "lng": "110.743529",
        "lat": "32.653656",
        "name": "东风技校图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "405",
        "lng": "112.208533",
        "lat": "30.35052",
        "name": "荆州市社会主义学院图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "406",
        "lng": "111.931102",
        "lat": "30.916843",
        "name": "当阳市第二图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "407",
        "lng": "110.354475",
        "lat": "31.045234",
        "name": "巴东县图书馆信陵镇分馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "408",
        "lng": "113.803521",
        "lat": "29.865444",
        "name": "嘉鱼县图书馆(高铁岭镇分馆)",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "409",
        "lng": "110.807707",
        "lat": "32.841018",
        "name": "兴郧路社区图书阅览室",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "410",
        "lng": "113.683608",
        "lat": "29.909447",
        "name": "嘉鱼县图书馆陆溪镇分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "411",
        "lng": "115.020926",
        "lat": "31.190264",
        "name": "阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "412",
        "lng": "115.674088",
        "lat": "30.741162",
        "name": "英山县数字图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "413",
        "lng": "113.375949",
        "lat": "30.241451",
        "name": "仙桃市图书馆张沟镇分馆",
        "cityname": "仙桃市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "414",
        "lng": "113.308321",
        "lat": "30.37715",
        "name": "仙桃市图书馆胡场分馆",
        "cityname": "仙桃市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "415",
        "lng": "115.374052",
        "lat": "30.754737",
        "name": "罗田理工中等专业学校图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "416",
        "lng": "113.880584",
        "lat": "29.709601",
        "name": "赤壁市实验中学-赤壁图书馆分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "417",
        "lng": "114.669857",
        "lat": "29.6559",
        "name": "通山县大畈中心图书馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "418",
        "lng": "114.489995",
        "lat": "29.602442",
        "name": "湖北省廉政文化图书馆通山分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "419",
        "lng": "115.391677",
        "lat": "30.989791",
        "name": "罗田县图书馆河铺镇分馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "420",
        "lng": "114.132949",
        "lat": "31.558979",
        "name": "大悟县图书馆龙门分馆",
        "cityname": "孝感市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "421",
        "lng": "114.687696",
        "lat": "29.523303",
        "name": "通山县图书馆九宫山镇分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "422",
        "lng": "115.625726",
        "lat": "30.58777",
        "name": "电子阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "423",
        "lng": "113.722538",
        "lat": "29.562909",
        "name": "赤壁市图书馆赵李桥分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "424",
        "lng": "113.832598",
        "lat": "31.617432",
        "name": "原图书馆",
        "cityname": "随州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "425",
        "lng": "112.898982",
        "lat": "30.407111",
        "name": "潜江市图书馆红庙社区分馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "426",
        "lng": "115.593687",
        "lat": "29.871888",
        "name": "武穴新图书馆",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "427",
        "lng": "113.842438",
        "lat": "29.324431",
        "name": "崇阳县图书馆肖岭分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "428",
        "lng": "112.773001",
        "lat": "30.505242",
        "name": "潜江市图书馆王场分馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "429",
        "lng": "113.986152",
        "lat": "29.211756",
        "name": "通城县图书馆塘湖镇分馆",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "430",
        "lng": "113.842278",
        "lat": "29.180357",
        "name": "黄鹤村退役军人服务站阅览室",
        "cityname": "咸宁市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "431",
        "lng": "112.711431",
        "lat": "30.230918",
        "name": "潜江市图书馆龙湾分馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "432",
        "lng": "112.8924",
        "lat": "29.814778",
        "name": "监利市图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "433",
        "lng": "112.671536",
        "lat": "30.865164",
        "name": "钟祥市图书馆旧口分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "434",
        "lng": "112.874427",
        "lat": "31.359803",
        "name": "钟祥市图书馆客店分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "435",
        "lng": "115.91554",
        "lat": "29.882626",
        "name": "图书阅览室",
        "cityname": "黄冈市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "436",
        "lng": "112.639658",
        "lat": "30.061708",
        "name": "沙岗文化站图书阅览室",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "437",
        "lng": "112.528419",
        "lat": "30.284429",
        "name": "运粮湖管理区公共图书馆",
        "cityname": "潜江市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "438",
        "lng": "112.607165",
        "lat": "29.965374",
        "name": "图书阅览室",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "439",
        "lng": "112.473654",
        "lat": "30.504072",
        "name": "沙洋县图书馆毛李镇分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "440",
        "lng": "112.479434",
        "lat": "30.272324",
        "name": "图书阅览室",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "441",
        "lng": "112.506781",
        "lat": "30.980374",
        "name": "钟祥市图书馆石牌分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "442",
        "lng": "112.449562",
        "lat": "30.08087",
        "name": "江陵县熊河镇图书阁览室",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "443",
        "lng": "112.630324",
        "lat": "29.689098",
        "name": "公益图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "444",
        "lng": "112.439039",
        "lat": "31.10316",
        "name": "钟祥市冷水镇共兴村图书室",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "445",
        "lng": "112.411272",
        "lat": "30.036429",
        "name": "国创集团图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "446",
        "lng": "112.531496",
        "lat": "29.714646",
        "name": "石首市图书馆东升分馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "447",
        "lng": "112.294845",
        "lat": "30.904359",
        "name": "荆门市麻城镇文化站图书室",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "448",
        "lng": "112.18196",
        "lat": "30.935203",
        "name": "前沿图书馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "449",
        "lng": "112.28437",
        "lat": "31.277898",
        "name": "钟祥市图书馆双河分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "450",
        "lng": "112.182144",
        "lat": "31.008433",
        "name": "荆门市图书馆新馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "451",
        "lng": "112.221857",
        "lat": "31.150376",
        "name": "天津市少年儿童图书馆(东宝分馆)",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "452",
        "lng": "112.315998",
        "lat": "31.429476",
        "name": "钟祥市图书馆胡集分馆",
        "cityname": "荆门市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "453",
        "lng": "112.077173",
        "lat": "30.364832",
        "name": "荆州学院图书馆",
        "cityname": "荆州市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "454",
        "lng": "112.732225",
        "lat": "32.132681",
        "name": "荆楚少儿图书馆枣阳市分馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "455",
        "lng": "111.93117",
        "lat": "30.916728",
        "name": "淯溪图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "456",
        "lng": "111.787506",
        "lat": "30.830184",
        "name": "城市书房(香榭三路店)",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "457",
        "lng": "111.596999",
        "lat": "30.520699",
        "name": "安福寺图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "458",
        "lng": "111.637116",
        "lat": "31.067606",
        "name": "图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "459",
        "lng": "112.184916",
        "lat": "32.054085",
        "name": "道安图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "460",
        "lng": "112.132277",
        "lat": "32.011078",
        "name": "襄城区图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "461",
        "lng": "112.130788",
        "lat": "32.011339",
        "name": "檀溪新居图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "462",
        "lng": "112.107513",
        "lat": "31.998817",
        "name": "湖北文理学院图书馆襄城区分馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "463",
        "lng": "112.141041",
        "lat": "32.047267",
        "name": "电子图书阅览室",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "464",
        "lng": "112.14444",
        "lat": "32.051198",
        "name": "病案图书室",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "465",
        "lng": "112.124736",
        "lat": "32.039615",
        "name": "樊城区退役军人服务中心图书流动站",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "466",
        "lng": "112.081682",
        "lat": "32.005613",
        "name": "襄阳职业技术学院图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "467",
        "lng": "112.042169",
        "lat": "31.998943",
        "name": "湖北文理学院-报刊阅览室",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "468",
        "lng": "111.428775",
        "lat": "30.669836",
        "name": "三峡旅游职业技术学院图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "469",
        "lng": "111.333602",
        "lat": "30.668801",
        "name": "宜昌市图书馆合益路社区分馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "470",
        "lng": "111.319056",
        "lat": "30.727611",
        "name": "云锦电子阅览室",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "471",
        "lng": "111.313091",
        "lat": "30.69215",
        "name": "湖北三峡职业技术学院图书馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "472",
        "lng": "111.282938",
        "lat": "30.712938",
        "name": "宜昌市图书馆西陵区土街头社区分馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "473",
        "lng": "111.505285",
        "lat": "31.654725",
        "name": "图书室",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "474",
        "lng": "111.210898",
        "lat": "31.107674",
        "name": "夷陵区图书馆雾渡河分馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "475",
        "lng": "111.678435",
        "lat": "32.10815",
        "name": "劝学图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "476",
        "lng": "111.04815",
        "lat": "30.15177",
        "name": "柏年图书室",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "477",
        "lng": "111.682444",
        "lat": "32.337987",
        "name": "老河口图书馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "478",
        "lng": "110.971757",
        "lat": "30.822924",
        "name": "神奇世界儿童图书借阅馆",
        "cityname": "宜昌市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "479",
        "lng": "111.258172",
        "lat": "31.877097",
        "name": "襄阳市图书馆第五分馆",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "480",
        "lng": "111.227138",
        "lat": "31.821537",
        "name": "保康县图书馆朱家厂村阅览室",
        "cityname": "襄阳市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "481",
        "lng": "111.532601",
        "lat": "32.547562",
        "name": "清源图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "482",
        "lng": "111.492971",
        "lat": "32.526033",
        "name": "丹江口市图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "483",
        "lng": "110.738565",
        "lat": "32.057713",
        "name": "房县图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "484",
        "lng": "110.29919",
        "lat": "30.452209",
        "name": "琦圣图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "485",
        "lng": "110.80656",
        "lat": "32.658559",
        "name": "十堰图书馆(传媒大厦分馆)",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "486",
        "lng": "110.439073",
        "lat": "32.134025",
        "name": "阅览室",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "487",
        "lng": "110.736788",
        "lat": "32.651709",
        "name": "十堰市张湾区图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "488",
        "lng": "110.679502",
        "lat": "32.645434",
        "name": "花果园社区图书阅览室",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "489",
        "lng": "110.636227",
        "lat": "32.627313",
        "name": "零夕图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "490",
        "lng": "110.374135",
        "lat": "32.901993",
        "name": "观音村图书室(农家书屋)",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "491",
        "lng": "109.511438",
        "lat": "30.292353",
        "name": "湖北恩施学院图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "492",
        "lng": "109.473591",
        "lat": "30.294916",
        "name": "城市书房(市府路店)",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "493",
        "lng": "109.451068",
        "lat": "30.27401",
        "name": "高桥坝村图书阅览室",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "494",
        "lng": "109.490304",
        "lat": "29.985059",
        "name": "宣恩县图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "495",
        "lng": "109.428996",
        "lat": "30.268232",
        "name": "童阅汇儿童阅读中心",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "496",
        "lng": "109.73737",
        "lat": "32.320171",
        "name": "竹溪县图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "497",
        "lng": "109.413711",
        "lat": "29.499934",
        "name": "来凤县图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "498",
        "lng": "109.409103",
        "lat": "29.501854",
        "name": "来凤县图书馆流动服务点",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "499",
        "lng": "109.331005",
        "lat": "29.572634",
        "name": "来凤县图书馆三胡乡分馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "500",
        "lng": "110.046021",
        "lat": "33.155607",
        "name": "爱家乡图书馆",
        "cityname": "十堰市",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "501",
        "lng": "108.833045",
        "lat": "30.265677",
        "name": "阅览室",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "502",
        "lng": "108.947736",
        "lat": "29.523459",
        "name": "杨中小图书馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "503",
        "lng": "108.795527",
        "lat": "30.424694",
        "name": "利川市图书馆南坪乡分馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    },
    {
        "id": "504",
        "lng": "108.709647",
        "lat": "30.2671",
        "name": "利川市图书馆江营镇分馆",
        "cityname": "恩施土家族苗族自治州",
        "province": "湖北省",
        "count": "1"
    }
]